Revit 2026 API
IFCHybridImport.ImportElements Method
Overload List
Name | Description
ImportElements(Document, String) | Obsolete.
 Imports IFC Elements using AnyCAD.
ImportElements(Document, String, IFCHybridImportOptions) |  Imports IFC Elements using AnyCAD.
Top
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace